#ifndef __SYSCONFIG_H
#define __SYSCONFIG_H
#include <stdint.h>

/*
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁
▏ ▁▁▁▁▁▁▁▁▁传动比▁▁导程▁▁行程max(单位:mm)▁▁行程max(单位:圈)▁▁▁速度max(单位：后出轴圈/s)▏ 
▏大拇指①号电机：▏ 80		▏ 3mm	▏	3.8568mm     	▏     102.848    	 ▏			 			268	▏
▏大拇指②号电机：▏ 80	   ▏ 3mm	▏	11.2412mm     	▏     299.765			 ▏			 			268	▏
▏食指  ③号电机：▏ 96		▏ 5mm	▏	15.26mm       	▏     292.992			 ▏		   			252	▏
▏中指  ④号电机：▏ 96		▏ 5mm	▏	15.26mm       	▏     292.992			 ▏			 			252	▏
▏无名指⑤号电机：▏ 96		▏ 5mm	▏	15.26mm       	▏     292.992			 ▏			 			252	▏
▏小拇指⑥号电机：▏ 96		▏ 5mm	▏	15.26mm       	▏     292.992			 ▏			 			252	▏
▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔
*/
/*
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁
▁▁▁▁▁▁▁▁▁电机旋转方向▁▁▁滑块位移方向▁▁▁关节运动方向   	▏
▏大拇指①号电机：   逆时针                           伸直(复位)	 	▏
▏									顺时针                           弯曲			    ▏
▏大拇指②号电机：   逆时针                           远离掌心(复位)▏
▏								  顺时针            前移           靠近掌心			▏
▏③④⑤⑥号电机：   顺时针			      前移           伸直(复位)	  ▏
▏                  逆时针           	后移           弯曲					▏
▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔
*/
/*
|环路-----------带宽------------执行/更新频率---------备注
 —————————————————————————————————————
|电流环-------≈10KHz--------------10KHz--------------ADC<—>PWM硬件同步
|速度环-------≈1KHz
|位置环         100Hz
|柔顺环         20Hz  
|轨迹规划       100Hz
*/




/*  ▏ KP   ▏ KI  ▏ KD  ▏ FF  ▏
25  ▏      ▏     ▏     ▏1.60 ▏ 
50  ▏      ▏     ▏     ▏1.40 ▏
75  ▏      ▏     ▏     ▏1.25 ▏
100 ▏      ▏     ▏     ▏1.15 ▏
125 ▏ 50   ▏0.2  ▏0.02 ▏1.10 ▏
150 ▏      ▏     ▏     ▏1.05 ▏
175 ▏      ▏     ▏     ▏1.03 ▏
200 ▏      ▏     ▏     ▏1.02 ▏ 
225 ▏      ▏     ▏     ▏1.01 ▏
250 ▏      ▏     ▏     ▏1.00 ▏
*/

#define MOTOR_COUNT        		6       //电机数量

#define DEFAULT_SYS_BAUDRATE   115200  //默认系统485波特率


#endif



